КАКерамика_моя_старая_база/src/Documents/ФинОтчетВБанк/ФинОтчетВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФинОтчетВБанк</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.БанкиУниверсальногоОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКомплекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставлениеКомплекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭкономическиеСубъекты</name>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субъект</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключатьОбособленныеПодразделения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отчетность</name>
    <attributes>
      <name>КлючСтрокиОтчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>254</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиКомплекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтчетСсылка</name>
      <type>
        <types>DocumentRef.РегламентированныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлОтчета</name>
      <type>
        <types>DefinedType.ПрисоединенныйФайл</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеНаименования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>Дата окончания</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФайлОтчетаСодержитЭП</name>
      <comment>Истина, если ФайлОтчета содержит ссылку на присоединный zip-архив, внутри которого есть в том числе файлы электронных подписей</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияДанныхОтчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОтсутствуют</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяКорректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнаяНастройка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженоИзВнешнегоФайла</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОтчетов</name>
    <attributes>
      <name>КлючСтрокиОтчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.ПараметрФинОтчетаВБанк</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСистемыНалогообложения</name>
    <comment>Заполняются при загрузке пакетов отчетности других компаний группы, которые ведут учет в собственных базах 1С:Бухгалтерии</comment>
    <attributes>
      <name>КлючСтрокиСубъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СистемаНалогообложения</name>
      <type>
        <types>EnumRef.СистемыНалогообложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНДоходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНДоходыМинусРасходы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлательщикЕНВД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяУСНПатент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлательщикТорговогоСбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименяетсяНалогНаПрофессиональныйДоход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/ЖурналСтатусовФинОтчетностиВБанки/ЖурналСтатусовФинОтчетностиВБанки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСтатусовФинОтчетностиВБанки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиФинОтчетностиВБанки</types>
    </type>
  </resources>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.СправочникБанкиФинОтчетность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиПредмета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостоянияДокументооборотаОбменаСБанками</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметОбменаСБанками</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/СтатусыОтправкиФинОтчетностиВБанки/СтатусыОтправкиФинОтчетностиВБанки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиФинОтчетностиВБанки</name>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>Сдано</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/СостоянияДокументооборотаОбменаСБанками/СостоянияДокументооборотаОбменаСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументооборотаОбменаСБанками</name>
  <enumValues>
    <name>ОтрицательныйРезультат</name>
  </enumValues>
  <enumValues>
    <name>ПоложительныйРезультат</name>
  </enumValues>
  <enumValues>
    <name>Начат</name>
  </enumValues>
  <enumValues>
    <name>НеНачат</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/ФинОтчетВБанк/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Организация");
		Банк        = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Банк");
		Дата        = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "КонецПериода");
		НачалоПериода = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "НачалоПериода", НачалоМесяца(Дата));
		ИдентификаторКомплекта        = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеЗаполнения, "ИдентификаторКомплекта");
		КраткоеПредставлениеКомплекта = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеЗаполнения, "КраткоеПредставлениеКомплекта");
	КонецЕсли;

	// Заполняем по умолчанию
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	// Фактическая дата создания пакета отчетности.
	ДатаСоздания = ТекущаяДатаСеанса();
	
	// Отчетную дату всегда подставляем как конец месяца.
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ДатаСоздания;
	КонецЕсли;
	Дата = КонецМесяца(Дата);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// При копировании полностью очистим ссылки на присоединные файлы, т.к. они относятся к другому документу.
	Для каждого СтрокаТаблицы Из Отчетность Цикл
		СтрокаТаблицы.ОтчетСсылка          = Неопределено;
		СтрокаТаблицы.ФайлОтчета           = Неопределено;
		СтрокаТаблицы.ФайлОтчетаСодержитЭП = Ложь;
		СтрокаТаблицы.ВерсияДанныхОтчета   = "";
	КонецЦикла;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Всегда подставляем как конец месяца.
	Дата = КонецМесяца(Дата);

	// Удалим из связанных табличных частей строки с неактуальными ключами.
	Документы.ФинОтчетВБанк.УдалитьНеактуальныеСтроки(ЭкономическиеСубъекты, Отчетность,       "КлючСтрокиСубъекта");
	Документы.ФинОтчетВБанк.УдалитьНеактуальныеСтроки(Отчетность,            ПараметрыОтчетов, "КлючСтрокиОтчета");
	Документы.ФинОтчетВБанк.УдалитьНеактуальныеСтроки(ЭкономическиеСубъекты, НастройкиСистемыНалогообложения, "КлючСтрокиСубъекта");
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("СинхронизироватьПрисоединенныеФайлы", Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем или обновляем данные в регистре ЖурналСтатусовФинОтчетностиВБанки.
	МенеджерЗаписи = РегистрыСведений.ЖурналСтатусовФинОтчетностиВБанки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Предмет     = Ссылка;
	
	// Сначала пробуем найти ранее записанные данные.
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		// Такой записи еще нет, заполняем ее полностью.
		МенеджерЗаписи.Организация              = Организация;
		МенеджерЗаписи.Предмет                  = Ссылка;
		МенеджерЗаписи.Статус                   = Перечисления.СтатусыОтправкиФинОтчетностиВБанки.НеОтправлено;
	КонецЕсли;
	
	// Обновим вспомогательную информацию.
	МенеджерЗаписи.Банк                     = Банк;
	МенеджерЗаписи.Наименование             = КраткоеПредставлениеКомплекта;
	МенеджерЗаписи.СостояниеСдачиОтчетности = Перечисления.СостоянияДокументооборотаОбменаСБанками.НеНачат;
	МенеджерЗаписи.ДатаНачала               = НачалоПериода;
	МенеджерЗаписи.ДатаОкончания            = КонецМесяца(Дата);
	
	МенеджерЗаписи.ФинансовыйПериод         = РегламентированнаяОтчетностьВызовСервера.ПредставлениеФинансовогоПериода(
												МенеджерЗаписи.ДатаНачала, 
												КонецДня(МенеджерЗаписи.ДатаОкончания));
	
	МенеджерЗаписи.ДатаЗаписиПредмета       = ТекущаяДатаСеанса();
	МенеджерЗаписи.Комментарий              = Комментарий;
	МенеджерЗаписи.ПометкаУдаления          = ПометкаУдаления;
	
	МенеджерЗаписи.Записать();

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "СинхронизироватьПрисоединенныеФайлы", Истина) Тогда
		// Если присоед. файлы из спр.ФинОтчетВБанкиПрисоедФайлы выбраны в строках в текущем документе,
		// то у них не должно быть пометки удаления, если есть - то ее снять. И наоборот - поставить для удаленных.

		ТипПрисоединенногоФайлаПакета = Тип("СправочникСсылка.ФинОтчетВБанкПрисоединенныеФайлы");
		СписокФайлов = Новый Массив;
		Для Каждого Отчет Из Отчетность Цикл

			Если ЗначениеЗаполнено(Отчет.ФайлОтчета)
			   И ТипЗнч(Отчет.ФайлОтчета) = ТипПрисоединенногоФайлаПакета Тогда
				СписокФайлов.Добавить(Отчет.ФайлОтчета);
			КонецЕсли;

		КонецЦикла;
		Если СписокФайлов.Количество() <> 0 Тогда
			
			СвойстваФайлов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокФайлов, "ПометкаУдаления", Истина);
		
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Синхронизация присоединенных файлов'");
			ПараметрыВыполнения.ОжидатьЗавершение           = 0;
			ПараметрыВыполнения.КлючФоновогоЗадания         = Строка(Ссылка.УникальныйИдентификатор());
			ПараметрыВыполнения.ЗапуститьВФоне              = Истина;

			ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
				"Документы.ФинОтчетВБанк.СинхронизироватьПрисоединенныеФайлы", Ссылка, СвойстваФайлов);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
